04_OpenFoam/_Tut_02/OpenFOAM-14/multiphaseEuler/pipeBend/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc populationBalanceSizeDistribution
(
    name=probabilityDensity.afterBend_1d,
    populationBalance=agglomerates,
    cellZone=
    {
        type        box;
        box         (-0.03 0.43 0.09) (0.03 0.48 0.11);
    },
    functionType=volumeDensity,
    coordinateType=diameter,
    normalise=yes
)

#includeFunc populationBalanceSizeDistribution
(
    name=probabilityDensity.afterBend_5d,
    populationBalance=agglomerates,
    cellZone=
    {
        type        box;
        box         (-0.03 0.43 0.25) (0.03 0.48 0.27);
    },
    functionType=volumeDensity,
    coordinateType=diameter,
    normalise=yes
)

#includeFunc populationBalanceSizeDistribution
(
    name=probabilityDensity.afterBend_9d,
    populationBalance=agglomerates,
    cellZone=
    {
        type        box;
        box         (-0.03 0.43 0.41) (0.03 0.48 0.43);
    },
    functionType=volumeDensity,
    coordinateType=diameter,
    normalise=yes
)

#includeFunc populationBalanceSizeDistribution
(
    name=probabilityDensity.beforeBend_1d,
    populationBalance=agglomerates,
    cellZone=
    {
        type        box;
        box         (-0.03 0.35 -0.03) (0.03 0.37 0.03);
    },
    functionType=volumeDensity,
    coordinateType=diameter,
    normalise=yes
)

// ************************************************************************* //
